Sudrien/m5tab5_m135_gnss_protomaps_live_area_map/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Project overrides.
# ---------------------------------------------------------------------------

# The target. Filtered out of the import with the other identity symbols;
# without it the build silently defaults to esp32 and configures xtensa.
CONFIG_IDF_TARGET="esp32p4"

# Board variant.
CONFIG_ARDUINO_VARIANT="m5stack_tab5"

# This project's partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- ESP-Hosted SDIO pins (deviation from the reference) -------------------
# The reference carries the generic P4 dev-board pinout. The Tab5 wires the
# C6 to clk 12, cmd 13, d0..d3 11/10/9/8, reset 15 - confirmed against
# M5Stack's own Tab5 firmware, whose sdkconfig carries exactly these values.
#
# These must be the PRIV_..._SLOT_1 symbols, not CONFIG_ESP_HOSTED_SDIO_PIN_*.
# The latter have no prompt:
#     config ESP_HOSTED_SDIO_PIN_CLK
#         int
#         default ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1 if ESP_HOSTED_SDIO_SLOT_1
# so they are derived and setting them here is silently ignored - which is
# exactly what happened: the boot log still read CLK[18] CMD[19] D0[14].
#
# It matters because esp_hosted_host_init() runs from a global constructor,
# so these compile-time values are what the transport actually uses.
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=12
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15

# ---- ESP-Hosted mempool (deviation from the reference) ---------------------
# On this esp_hosted version sdio_mempool_create asserted during global
# constructors with 256 KB of internal RAM free, so it is off here.
#
# Worth revisiting: M5Stack's own Tab5 demo firmware runs with
# CONFIG_ESP_HOSTED_USE_MEMPOOL=y on the same silicon, so the pool is not
# inherently broken. The assert was most likely a side effect of whatever
# else was wrong at the time - the IDF version, or the pins, both since
# fixed. Try turning it back on; if it boots, delete this override.
CONFIG_ESP_HOSTED_USE_MEMPOOL=n

# ---- TEMPORARY: diagnostics ------------------------------------------------
# The reference sets LOG_DEFAULT_LEVEL_ERROR, right for shipping and wrong
# while the board is being brought up: it silences heap_init and esp_psram.
# Not the bootloader's level - raising that overflows its 0x6000 partition.
#
# MAXIMUM at VERBOSE, DEFAULT at INFO. The maximum is compile-time: at INFO
# every ESP_LOGV is discarded by the preprocessor, and M5GFX logs its entire
# I2C probe at that level -
#     ESP_LOGV(LIBRARY_NAME, "[Autodetect] i2c addr:%02x = %s", ...)
# which is exactly what says whether the bus works and what answered. The
# default stays at INFO so nothing else floods; setup() raises M5GFX alone
# with esp_log_level_set("M5GFX", ESP_LOG_VERBOSE).
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
